{
  "name": "Aladdin Ali",
  "nickname": "Naxe",
  "title": "Senior Backend / Full-Stack Engineer (.NET)",
  "bio": "I build C#/.NET backends that teams can trust in production: APIs, integrations, and the tooling that keeps behavior easy to see. I like cleaning up legacy systems, automating the boring parts with CI, and making it simple to answer “what happened?” when something goes sideways.",
  "email": "naxecode@proton.me",
  "social": {
    "github": "https://github.com/naxecode",
    "linkedin": "https://linkedin.com/in/aladdin-ali01",
    "twitter": "https://twitter.com/naxecode"
  },
  "journey": [
    {
      "title": "Senior Backend Engineer · MahiGaming",
      "period": "Jan 2025 – Present · Deerfield Beach, FL",
      "description": "I build backend services in a regulated environment, where correctness and auditability decide what ships. I lean on repeatable workflows (CI and tooling) so changes are easy to review and easy to trust."
    },
    {
      "title": "Full Stack Engineer · Coppei",
      "period": "Jul 2022 – Jan 2024 · Seattle, WA (Remote)",
      "description": "I shipped internal tools and APIs, sped up reporting and data flows, and tightened onboarding and deployments so releases stayed routine."
    },
    {
      "title": "Backend Engineer · Affordable Lock & Security",
      "period": "Feb 2024 – Dec 2024 · Orlando, FL",
      "description": "I built backend services for routing, scheduling, and quoting, then focused on speed and reliability so dispatch could move without friction."
    },
    {
      "title": "Haxe / Graphics Engineer · Sandbox Network",
      "period": "Feb 2019 – Jul 2022 · Seattle, WA (Remote)",
      "description": "I worked on performance-heavy engine code (rendering and diagnostics), where profiling and measurement mattered more than guessing."
    }
  ],
  "highlights": [
    "I build APIs and integrations in C#/.NET that hold up under real-world constraints.",
    "I use AI to cut busywork, but I keep guardrails and validation in place so results don’t surprise anyone.",
    "When a UI is needed, I keep it clean and consistent (React/Next.js), especially for internal tools."
  ]
}
