{
  "name": "Aladdin Ali",
  "nickname": "Naxe",
  "title": "Software Engineer",
  "bio": "I’m a backend-first software engineer who builds dependable systems in C#/.NET. I’ve worked on platforms with tight reliability requirements, modernized older codebases, and built tooling that helps teams move faster without losing control.",
  "email": "naxecode@proton.me",
  "social": {
    "github": "https://github.com/naxecode",
    "linkedin": "https://linkedin.com/in/aladdin-ali01",
    "twitter": "https://twitter.com/naxecode"
  },
  "journey": [
    {
      "title": "Senior Backend Engineer · MahiGaming",
      "period": "Jan 2025 – Jan 2026 · Deerfield Beach, FL",
      "description": "Built and improved backend services in a regulated environment, with a focus on correctness, auditability, and repeatable workflows (CI, tooling, and cross-platform modernization)."
    },
    {
      "title": "Integration Developer · Lawn Basics",
      "period": "Jul 2024 – Jan 2025 · Portland, OR",
      "description": "Built integrations and automation around scheduling, invoicing, and payments to make day-to-day operations smoother and more consistent."
    },
    {
      "title": "Full Stack Engineer · Coppei",
      "period": "2023 – 2024 · Remote",
      "description": "Shipped internal tools and APIs, improved database performance, and put stronger onboarding/deployment workflows in place so releases stayed predictable."
    },
    {
      "title": "Backend Engineer · Affordable Lock & Security",
      "period": "2022 – 2023 · Orlando, FL",
      "description": "Built backend services for routing, scheduling, and quoting; improved performance and reliability in the systems teams used every day."
    },
    {
      "title": "Haxe / Graphics Engineer · Sandbox Network",
      "period": "2021 – 2022 · Remote",
      "description": "Worked on performance-heavy engine code—rendering, threading, and diagnostics—building a strong foundation in profiling and optimization."
    },
    {
      "title": "Earlier Roles · Unity/Support Engineering",
      "period": "2019 – 2021 · Remote",
      "description": "Unity engineering (Kyuppin Games) and support development (Your Idea Here)."
    }
  ],
  "highlights": [
    "Built secure, server-first integrations (finance, auth, and data-heavy workflows).",
    "Used AI thoughtfully for automation—focused on guardrails, validation, and predictable behavior.",
    "Enjoy building reusable UI foundations that keep products consistent as they grow."
  ]
}
