[
  {
    "role": "Senior Backend Engineer",
    "company": "MahiGaming",
    "period": "Jan 2025 – Present",
    "location": "Deerfield Beach, FL",
    "bullets": [
      "Built C#/.NET services that power core platform workflows, with an emphasis on correctness, auditability, and clear operational visibility.",
      "Refactored an internal verification tool into a plugin-based system so new checks could be added quickly without rewriting the core.",
      "Made simulation-style workloads reproducible with Docker + CI, improving throughput and cutting wasted compute.",
      "Helped modernize internal desktop tooling from WPF to Avalonia for smoother cross-platform workflows and better observability."
    ]
  },
  {
    "role": "Backend Engineer",
    "company": "Affordable Lock & Security",
    "period": "Feb 2024 – Dec 2024",
    "location": "Orlando, FL",
    "bullets": [
      "Built ASP.NET Core APIs that supported real-world operations—routing, scheduling, quoting, and the day-to-day tools field teams rely on.",
      "Improved SQL Server performance and data consistency with schema cleanup, indexing, and targeted stored procedures.",
      "Made key endpoints faster and more resilient with caching, retries, and better failure handling.",
      "Reduced manual work by automating CRM, scheduling, and billing integrations."
    ]
  },
  {
    "role": "Full Stack Engineer",
    "company": "Coppei",
    "period": "Jul 2022 – Jan 2024",
    "location": "Seattle, WA (Remote)",
    "bullets": [
      "Shipped an internal admin product (ASP.NET Core + React + SQL Server) that streamlined employee and operations workflows.",
      "Designed APIs and data models that made reporting faster and the system easier to evolve over time.",
      "Automated onboarding and deployments with CI so new environments could be spun up in hours instead of days.",
      "Upgraded authentication and authorization with modern token-based flows and role-based access control."
    ]
  },
  {
    "role": "Haxe / Graphics Engineer",
    "company": "Sandbox Network",
    "period": "Feb 2019 – Jul 2022",
    "location": "Seattle, WA (Remote)",
    "bullets": [
      "Owned parts of a cross-platform rendering stack (Haxe/C++) used on desktop and mobile.",
      "Profiled CPU/GPU bottlenecks and improved pipelines and shaders to raise performance and stability.",
      "Worked closely with artists to ship visual effects that looked good without breaking performance budgets.",
      "Built tooling that made debugging faster and iteration less painful for the whole team."
    ]
  }
]
