[
  {
    "slug": "stargazers-cosmic-watchlist",
    "title": "Cosmic Watchlist",
    "summary": "I built a premium, server-first watchlist for anime, films, TV, and games with shareable filters and smart stats.",
    "description": "I built a server-first watchlist designed to stay fast even with messy metadata and heavy filtering. It uses Server Actions with strict Zod validation, keeps views shareable via URL-based filters, and surfaces stats like completion rate and runtime totals. Optional TMDB/OMDb enrichment adds recommendations without turning the core workflow into a cluttered feature pile.",
    "highlights": [
      "Server-first CRUD via Server Actions with strict Zod validation and Google OAuth.",
      "Shareable filters via URL params for bookmarks and clean links.",
      "Smart stats with optional TMDB/OMDb enrichment for recommendations.",
      "Database-first source of truth with server-rendered pages and minimal client state.",
      "Revalidation after writes to keep views fresh without heavy client caching.",
      "Cosmic UI + Radix primitives for consistent, accessible UI patterns."
    ],
    "tags": ["Next.js", "TypeScript", "Drizzle", "PostgreSQL", "Auth.js"],
    "category": "full-stack",
    "year": "2024 - 2025",
    "featured": true,
    "github": "https://github.com/NaxeCode/Stargazers-Cosmic-Watchlist",
    "demo": "https://stargazers-cosmic-watchlist.vercel.app",
    "demoType": "none",
    "stack": {
      "frontend": [
        "Next.js 16",
        "React 19",
        "TypeScript",
        "Tailwind CSS",
        "@stargazers-stella/cosmic-ui",
        "Radix UI",
        "framer-motion"
      ],
      "backend": [
        "Next.js Server Actions",
        "Zod validation",
        "Auth.js (Google OAuth)",
        "TMDB / OMDb APIs"
      ],
      "database": ["PostgreSQL", "Drizzle ORM"],
      "tools": ["Vercel", "Vercel Analytics", "Speed Insights", "Vitest"]
    }
  },
  {
    "slug": "photon-trail",
    "title": "Photon Trail",
    "summary": "I built a personal finance dashboard that connects accounts, organizes transactions, and makes spend patterns easy to review.",
    "description": "I built Photon Trail around one constraint: sensitive data stays backend-controlled. It connects accounts via Plaid, syncs and organizes transactions, and presents spending in a clean dashboard behind protected routes. I kept the UI simple on purpose: readable charts, consistent categorization, and a workflow that’s easy to understand and hard to misuse.",
    "highlights": [
      "I handled account linking and sync with backend-controlled tokens and protected routes.",
      "I organized transactions with consistent categorization to make patterns easier to review.",
      "I shipped a clean dashboard with visuals focused on readability over noise."
    ],
    "tags": ["Next.js", "Plaid", "OpenAI", "PostgreSQL", "NextAuth"],
    "category": "full-stack",
    "year": "2024 - 2025",
    "featured": true,
    "github": "https://github.com/NaxeCode/Photon-Trail",
    "demoType": "none",
    "stack": {
      "frontend": ["Next.js 14", "React 18", "TypeScript", "Tailwind CSS", "Chart.js"],
      "backend": ["Plaid API", "OpenAI SDK", "NextAuth"],
      "database": ["Neon (PostgreSQL)", "Drizzle ORM"],
      "tools": ["Vercel", "Zod"]
    }
  },
  {
    "slug": "cosmic-digest",
    "title": "AI Signal Digest",
    "summary": "I built a scheduled RSS digest worker that filters noise, tags topics, and emails a clean summary.",
    "description": "I built a .NET worker that runs unattended: it pulls RSS feeds, scores relevance, tags topics, and emails a digest on a schedule. The main goal is consistency. Runs are deterministic, configuration is straightforward, and containerized deployment keeps behavior the same across environments.",
    "highlights": [
      "I kept digests readable with relevance scoring and topic tagging to reduce feed overload.",
      "I surfaced trend signals and alerts so important changes stand out without constant monitoring.",
      "I ran it consistently across environments with a Dockerized worker and simple scheduling."
    ],
    "tags": [".NET 10", "C#", "OpenAI", "Mailgun", "Docker"],
    "category": "tool",
    "year": "2024 - 2025",
    "featured": true,
    "github": "https://github.com/NaxeCode/Cosmic-Digest",
    "demoType": "none",
    "stack": {
      "backend": [".NET 10 (C#)", "OpenAI API", "Mailgun API", "CodeHollow.FeedReader", "AngleSharp"],
      "tools": ["Docker"]
    }
  },
  {
    "slug": "cosmic-ui",
    "title": "Cosmic UI",
    "summary": "I built a small React component library that standardizes accessible UI patterns and theming.",
    "description": "I built a lightweight component library to solve a common team problem: consistent UI without rebuilding the same components in every app. It wraps accessible primitives, standardizes variant patterns, and uses CSS variables so theming stays flexible without getting fragile. Automated publishing keeps releases low-friction.",
    "highlights": [
      "I wrapped accessible primitives in clean, variant-driven component APIs.",
      "I kept theming simple with CSS variables for stable light/dark and brand variations.",
      "I automated publishing so releases stay consistent and low-friction."
    ],
    "tags": ["React", "TypeScript", "Radix UI", "Tailwind CSS", "Design System"],
    "category": "design-system",
    "year": "2024 - 2025",
    "featured": true,
    "github": "https://github.com/stargazers-stella/cosmic-ui",
    "demoType": "none",
    "stack": {
      "frontend": ["React 18/19", "TypeScript", "Radix UI", "Tailwind CSS"],
      "tools": ["tsup", "class-variance-authority", "GitHub Actions", "GitHub Packages"]
    }
  }
]
